Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: My router will contact its default DNS server, which will then search for the address “www.thediygolfer.com".
ru: Маршрутизатор свяжется со своим DNS-сервером по умолчанию, который затем выполнит поиск адреса “www.thediygolfer.com".

source: NGS data analysis process consists of the individual operations on genetic data, which are stores in files.
ru: Процесс анализа данных NGS состоит из отдельных операций с генетическими данными, которые хранятся в файлах.

source: NI - The “Nice” value of the process.
ru: NI - Значение “Nice” процесса.

source: Natinal Research Irkutsk
ru: Национальный исследовательский Иркутский

source: Networking is a huge concept.
ru: Приобретение навыков управления сетью в командной строке - это огромная и интересная задача.

source: Networking on Command Line
ru: Управление сетью в командной строке

source: Networking on the command line
ru: Работа с сетью в командной строке

source: New engines (data structures, inference engines, indexing etc.) for manipulating with automatic theorem proving supporting multisets; techniques and transformation software for representation of RDDESU with SysML diagrams; methods of representation of manufacturing processes as RDDESU; computer supervisor control synthesis software for RDDESU with external uncertainties.
ru: Новые программные механизмы (структуры данных, логический вывод, процедуры построения индексов и т.п.) для поддержки автоматического доказательства теорем с использованием мультимножеств; программы трансформации диаграмм SysML в РУДССН; модели представления производственных процессов в виде РУДССН; программы синтеза супервизорного управления для РУДССН с внешними неопределенностями.

source: Next stage will deal with realizing data conversion to other NGS processing software such as open-source QIIME2 and proprietary one like Usearch.
ru: Следующий этап будет связан с реализацией преобразования данных во внешнее программное обеспечение обработки NGS, такое как QIIME2 с открытым исходным кодом или проприетарное программное обеспечение, такое как Usearch.

source: Next step is figuring out unique sequences and count their replicas.
ru: Следующим шагом будет определение уникальных последовательностей и подсчет их реплик (точных копий).

source: Next, I want to show how to transfer files to and from your remote machine and local computer.
ru: Далее покажем, как передавать файлы между локальным и удаленным компьютером.

source: Next, install the rmate utility on your VPS.
ru: Затем установите утилиту rmate на VPS.

source: Not all of the following topics are solely bash concepts, but they are important to be aware of even if you are not going to be using them on a daily basis.
ru: Не все из вышеперечисленного относится непосредственно к концепциям bash, но их важно знать, даже если они не используются ежедневно.

source: Not all that useful to us–just general info
ru: Общая информация

source: Not only will this command list processes, but it will also update the status of each process in real time.
ru: Этот список не просто выдается, но и отслеживает статус каждого процесса в реальном времени.

source: Not to beat a dead horse here, but again, if you do not have access to Python or Perl (remember, you must download these to a machine while sed/awk are usually installed already), you are going to need to learn how to use sed and awk.
ru: Однако в некоторых задачах администрирования обрабатывать тексты приходится при помощи sed и awk, так как, опять же, может не быть доступа к Python или Perl.

source: Note: I will be modifying some of the IP addresses and server addresses throughout the tutorial to protect my own privacy, but will not be changing them materially enough to affect the concepts explained herein.
ru: Примечание: некоторые IP-адреса и адреса серверов изменены на протяжении всего руководства, чтобы защитить конфиденциальность Зака, однако указанные изменения не влияют концептуально на излагаемый материал.

source: Notice how I added .pub at the end.
ru: Обращаем внимание на .pub в конце.

source: Notice how when we place the ^ inside the character set it now acts as a negation rather than “search from the beginning of the line”.
ru: Обратите внимание, размещение ^ внутри выражения действует как отрицание, а не «начало строки».

source: Notice that the top of the file has something called a “shebang” (#!/bin/bash), which tells the interpreter which executable to run the script against.
ru: Обратите внимание, что в верхней части файла есть что-то, называемое «шебанг» (#!/bin/bash), сообщающий операционной системе интерпретатор, который будет исполнять файла-скрипт.

source: Notice there is a lot of information here, and most of it is comments (indicated by ;;).
ru: Обратите внимание, что здесь много информации, и по большей части это комментарии (обозначены ;;).

source: Now make the script executable.
ru: Теперь устанавливаем флаг, позволяющий запускать скрипт.

source: Now that we have the file separated by spaces, we can look to awk to do some better summarization.
ru: Теперь, когда у нас есть файл, где столбцы разделены пробелами. Теперь можно использовать awk для вычисления агрегированных значений.

source: Now that you know the basics of bash scripting, we can get to the practical example of checking a specific folder for files and moving them to an archive.
ru: Теперь, когда вы знакомы с основами создания сценариев bash, можно перейти к практическому примеру проверки определенной папки на наличие файлов и их перемещения в архив.

source: Now the question becomes–what is the difference?
ru: Теперь возникает вопрос: в чем разница между этими утилитами?

source: Now when we run our regular expressions, we will match all the email addresses and the new line that I added.
ru: Теперь, если запустить регулярные выражения, в результате сопоставлены будут все адреса электронной почты, а также и новая добавленная строка.

source: Now, find the IP address of your new virtual machine and type the following command into your terminal.
ru: Теперь надо найти IP-адрес новой виртуальной машины и ввести в терминале следующую команду.

source: Now, in your terminal, enter the following command to connect to your VPS.
ru: Теперь в локальном терминале наберите команду подключения к VPS.

source: Now, let’s say that we want to match all the lines of text that end in a question mark.
ru: Теперь предположим, надо сопоставить все строки текста, заканчивающиеся вопросительным знаком.

source: Now, type ctrl-shift P again, and type “>Remote: Start Server”.
ru: Наберите ctrl-shift P и “>Remote: Start Server”.

source: Nowadays, awk and sed are contentious topics, and in this section, I hope to clarify why this is the case and introduce the two commands’ basic usages.
ru: В настоящее время, awk и sed являются предметом споров и обсуждений, и в этом разделе попробуем разъяснить почему это происходит, ну и покажим основные формы их использования.

source: ORLANDO tools allows programmer to represent a set of dependable modules as a network, describe additional constraints, and then construct an execution plan and schedule on a cluster, which features are also described.
ru: ORLANDO-tools позволяет программисту создавть модель зависимости между модулями в виде сети, описывать дополнительные ограничения, а затем строить планы выполнения на кластере, свойства которого также описываются пользователем.

source: OTU contains sequences, which have a predefined mutation level usually not over 3%.
ru: OTU содержит последовательности, у которых заранее определенный уровень мутации, обычно не превышающий 3%.

source: Objects analyze structure of models and other objects generating intermediate structures representing the structure of modules to be generated as source code.
ru: Объекты Logtalk анализируют структуры моделей и других объектs, порождают промежуточные структуры, представляющие модели, на основе которых генерируется исходный код ИС.

source: Obviously, you will replace the IP address with your own.
ru: Замените IP-адрес своим.

source: Often times a collection of sequences will have a significant number of identical sequences.
ru: Часто набор входных последовательностей имеет значительное количество идентичных последовательностей.

source: Oftentimes, users will get confused when talking about environment variables and shell variables.
ru: Пользователи bash часто путаются, говоря о переменных среды и переменных оболочки.

source: On Digital Ocean, I will paste it here.
ru: В Digital Ocean это делается так.

source: On Mac, you can access this with the Network Utility.
ru: На Mac доступ к функциям traceroute осуществляется при помощи Network Utility.

source: On linux, you can install it by typing sudo apt-get install whois in your terminal.
ru: В Linux она устанавливается путем выполнения sudo apt-get install whois в терминале.

source: On the other end, the server which is running my website will find the HTML document that was requested (the home page), package it up, and send it back to the requesting IP address (my computer).
ru: С другой стороны, сервер, на котором работает веб-сайт, найдет запрошенный HTML-документ (домашняя страница), упакует его и отправит обратно на запрашивающий IP-адрес (мой компьютер).

source: On the other hand, we can do the same for UGENE, allowing user to work with more responsive dynamic interface of the UGENE desktop application.
ru: С другой стороны, мы можем сделать то же самое для UGENE, позволяя пользователю работать с более отзывчивым динамическим интерфейсом настольного приложения UGENE.

source: Once downloaded, open your Settings by typing ctrl-shift + P, and typing “>Preferences:Open User Settings”.
ru: После загрузки откройте настройки, набрав ctrl-shift + P и набрав “>Preferences:Open User Settings”.

source: Once in this mode, you can use the a and w keys to move between the four windows (you will see the window update in the top left corner of the page), and type G to rename the current window to whatever you want.
ru: Оказавшись в этом режиме, можно использовать клавиши a и w для перемещения между четырьмя окнами (вы увидите факт обновления окна в левом верхнем углу страницы) и G для переименования текущее окна.

source: Once it finds the network, the router is in charge of routing that information to the correct device in my local network.
ru: Как только он находит сеть, маршрутизатор отвечает за маршрутизацию информации на нужное устройство в локальной сети.

source: Once it reaches the router, the router will act as a “sorting machine” and route the request where it needs to go.
ru: Как только он достигнет маршрутизатора, устройство будет действовать как «сортировочная машина» и направлять запрос туда, куда нужно.

source: Once you are in less, your biggest asset is the h option.
ru: В запущенной программе есть замечательная функция - h.

source: Once you have copied the contents of this file, paste it into the SSH key box on your hosting provider.
ru: Скопировав содержимое этого файла, вставьте его в поле ключа SSH в соответствующее поле при регистрации виртуальной машины хостинг-провайдере.

source: Once you have done that, you can create your virtual machine.
ru: Как только это сделано, можете создавать свою виртуальную машину.

source: Once you have set your favorite configuration, exit out of the field manager and type W to save your settings to the ~/.toprc file.
ru: После того как настройка top будет закончена, можно выйти из экрана настройки полей и нажмите клавишу W чтобы сохранить настройки в файле ~/.toprc

source: Once you know the basic syntax, a few Google searches will usually get you to the awk one-liner that you need for your given situation.
ru: Основы синтаксиса awk можно узнать, сделав соответствующие запросы к поисковой системе Google, такжк можно найти примеры решения конкретных задач.

source: One of the approaches that uses system state forecasting is the receding horizon optimization strategy improving the control inputs of the system.
ru: Один из подходов, который использует прогнозирование состояния системы, - это построение стратегии оптимизации на основе удаляющегося горизонта; применение такой стратегии, как правило, позволяет улучшить значения управляющих сигналов (inputs of system).

source: One of the most important concepts to understand regarding processes is the background vs. the foreground process and how to switch between the two.
ru: Одной из наиболее важных концепций, которую нужно понимать в отношении процессов, является фоновый режим процесса и "переднмй план" и как переключаться между ними.

source: Open ~/.profile (or wherever you define your PATH environment variable), and add the following line.
ru: Редактируем ~/.profile (или другой, где определяется переменная PATH), добавляем следующую строку.

source: Open our file to search
ru: Открыть файл с текстом для поиска

source: Open questions are dynamic partitioning of the set of controlled events according to the type of their processing to meet the specifications, selection of common observed events, identifying events that violate the terms of controllability, observability, and co-observability.
ru: Открытые вопросы - это динамическое разделение множества контролируемых событий по типу их обработки, так, чтобы управление соответствовало спецификации, отбор общий наблюдаемых событий, распознавая события, нарушающие условия управляемости, наблюдаемости и ко-наблюдаемости.

source: Other methods include underground cables and dish satellites.
ru: Другие вариянты включают подземные кабели и спутниковые тарелки.

source: Other original features of PCFs are investigated and adapted in solutions of the technical problems.
ru: Исследуются и адаптируются другие оригинальные особенности ПОФ в решении различных технических задач.

source: Other uses for find could include:
ru: Другие виды использования find включают:

source: Our domain of our IT R&D is related to processing data within natural science research activities, which are characterized with varieties of tasks, methods and the multidisciplinary aims.
ru: Наша область исследований и разработок в области ИТ связана с обработкой данных в рамках естественнонаучных исследований, которые характеризуются разнообразием задач, методов и мультидисциплинарных целей.

source: Our first priority is to learn the interface of the top command and what we need to look for in the output.
ru: Приоритетом в изучении здесь является интерфейс команды top и что нужно искать на экране.

source: Our project data structures represent the whole computer simulation object, which is essentially a PCF formula defining RDDESU.
ru: Структуры двнных в проекте представляют весь объект имитационного моделирования, которым по сути является ПОФ-представление РУДССН.

source: Our question now is what does the router do with the signal?
ru: Теперь наш вопрос: что маршрутизатор делает с сигналом?

source: Over these sets, similarly, operations, filters and constraints can be also defined.
ru: Над полученными множествами аналогично определяются операции, фильтры и ограничения.

source: Overall research scheme and technical route to realize semantic interoperability and automatic text classification
ru: Общая схема исследования и технические средства реализации семантической интеграции и автоматической классификации текста

source: P. 1406-1424), as well as the application of this approach to meet the requirements of traffic safety on the railway haul Potehin A.I., Branishtov S.A., Kuznetsov S.K.
ru: P. 1406-1424), а также применению этого подхода для обеспечения требований безопасности движения на железнодорожном перегоне (Potehin А. И., С. Branishtov А., Кузнецов С. К.

source: P. 335-377), to the selection of control actions on the basis of existing local decisions is proposed.
ru: P. 335-377), к выбору управляющих воздействий на основе существующих локальных решений.

source: PATH variable
ru: Переменная PATH

source: PID - process ID
ru: PID - Идентификатор процесса

source: PR - The priority of the process (rt means the priority is set in real time)
ru: PR - Приоритет, согласно которому выполняется процесс (значение rt обозначает, что процесс выполняется в реальном времени)

source: PSM is built out of Platform Independent Model (PIM) representing the software on a more abstract level than PSM. It expresses the relations between entities, their object structures, metainformation and so on.
ru: PSM построен на основе платформенно-независимой модели (PIM), представляющей программное обеспечение на более абстрактном уровне, чем PSM. Он выражает отношения между сущностями, их объектные структуры, метаинформацию и т.д.

source: PaaS will enable biologists to analyze and investigate data themselves, DaaS will allow bioinformatic specialists to work with data on demand when designing new data processing techniques, and SaaS services will support the individual operations for PaaS.
ru: PaaS позволит биологам самим анализировать и исследовать данные, DaaS позволит специалистам по биоинформатике работать с данными по запросу при разработке новых методов обработки данных, а услуги SaaS будут поддерживать отдельные операции для PaaS.

source: Paper [13] contains an excellent review of current achievements in NGS and related areas.
ru: В статье [13] содержится превосходный обзор текущих достижений в области NGS и смежных областях.

source: Parameter structure and output of a Mothur command is intricate: we need to trace file names change from a command to the following one.
ru: Структура параметров и вывод команды Mothur сложны: необходимо отслеживать изменение имен файлов от команды к команде.

source: Performing computer simulation on test and industrial-like problems.
ru: Выполнение имитационного моделирования на тестовых и промышленных задачах.

source: Perl and Python are far more advanced and usable scripting languages.
ru: Бесспорно, Perl и Python являются гораздо более удобными языками реализации сценариев.

source: Perl/Python can do the same exact things with simpler syntax.
ru: Языки Perl/Python также позволяют обрабатывать текст, при этом использовать более простой синтаксис.

source: Permanently Add Keys to ssh-agent
ru: Добавление постоянных ключей в ssh-agent

source: Play around a bit and you will be on your way!
ru: Пишите свои скрипты, и будет вам счастье!

source: Please note that the output has been trimmed for brevity and only the IP, TCP, and UDP protocols have been included.
ru: Обратите внимание, что вывод также брезан для краткости, и включены только протоколы IP, TCP и UDP.

source: Please note this command is only available on Linux.
ru: Обратите внимание - эта команда доступна только на Linux.

source: Polynomial complexity algorithms of a priori partitioning of the set of controlled events into these subsets of events processed on a “fusion by union” of allowed events and processed on a “fusion by intersection” and algorithms for constructing a decentralized supervisor are given.
ru: --- Получены алгоритмы полиномиальной сложности для априорно разделенного множества контролируемых событий в подмножества событий, обработанных по “слиянию Союз” разрешенных событий и обрабатываются на “слияние путем пересечения” и алгоритмы децентрализованной руководитель даны.

source: Pospelov in 1986.
ru: Поспеловым в 1986 году.

source: Predictive control is a model-based optimization control approach.
ru: Среди подходов к оптимизации, основанных на моделировании производства, выделяются модели предиктивного управления.

source: Presenting results on international conferences.
ru: Представление результатов на международных конференциях.

source: Press q to quit.
ru: Нажатие q для выхода из программы.

source: Previously, you had to use “dial up” where you would literally “call in” through the phone line to access the internet.
ru: Раньше приходилось использовать «дозвон», когда пользователи буквально «звонили» по телефонной линии для доступа в Интернет.

source: Problem 1 (Cross-context problem , CC ) : Semantic documents of different contexts are heterogeneous in three levels: document syntax (e.g., document users adopt different document representation languages), document template (e.g., different users autonomously design different templates for a same business purpose such as product inquiry), and document instance (e.g., document users instantiate a same document template by using differently defined vocabularies). Thus, heterogeneous documents have interoperability problem. This problem can be further divided into two sub-problems: consistency of cross-context document understanding (CCDE) and automatic document interpretation (ADI) .
ru: Проблема 1 (Кросс-контекстные задачи , ККЗ ) : семантические документы различного контекстов неоднородны в трех уровнях: синтаксическая структура документа (например, пользователи документов ипользуют различные языки представления документов), шаблон документа (например, пользователи автономно дизайн разные шаблоны для одного и того же бизнес-цели, такие как продукт запрос), и экземпляра документа (например, документ пользователями экземпляра в тот же шаблон документа с использованием разному определяют словари). таким образом, разнородные документы имеют проблемы совместимости. эта проблема может быть поделена на две подпроблемы: последовательность кросс-контекст документа понимании (CCDE) и автоматическая документ толкования (Ади) .

source: Problems to be solved:
ru: Проблемы, которые будут решены:

source: Process Management and System Management
ru: Управление процессами и системой

source: Process and system management sounds like an intimidating concept, but for the average bash user, there are only a few commands and programs that you will need to learn to get a holistic understanding of how your computer runs.
ru: Управление процессами и системой звучит как-то пугающе. Для обычного пользователя bash существует несколько полезных команд и программ, которые надо изучить, чтобы получить целостное представление о том, как работает компьютер.

source: Process management
ru: Управление процессами

source: Processes Behind the Scenes
ru: Закулисы процессов

source: Publishing papers and reports.
ru: Публикация статей и докладов.

source: RDF data representation
ru: Представление данных RDF

source: RES - subset of VIRT
ru: RES - часть VIRT, расположенная конкретно в ОЗУ

source: Rainbow is essentially a Perl script implementing map (division) for input and reduce (join) for output data, together with distribution of the data pieces between Amazon EC2 cloud nodes.
ru: По сути, Rainbow - это сценарий Perl, реализующий операцию map (разделение) над входными данными и reduce (соединение) для получения выходных данных, разделенные части распределябтся между узлами облачного сервиса Amazon EC2.

source: Ramadge, W.M. Wonham, S. Lafortune, K. Rohloff, T. Yoo et al.) is widely used.
ru: Ramadge, W.M. Wonham, S. Lafortune, K. Rohloff, T. Yoo et al.).

source: Reactions are constructed for both competitors and counterparties (suppliers, consumers).
ru: Реакция строится на события, пораждаемые как конкурентами, так и контрагентами (поставщиками, потребителями).

source: Read each character in the file one by one, seeing if that character matches the first character in our search string
ru: Читать последовательно каждый символ в файле один за другим и проверять, соответствует ли этот символ первому символу в нашей строке поиска.

source: Reading user input
ru: Чтение пользовательского ввода

source: Real time is the total elapsed time that it took to run the program.
ru: Реальное (real) время - это общее время, затраченное на выполнение программы.
